# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Vit\Documents\PSoC Creator\SensorTest\SensorTest.cydsn\SensorTest.cyprj
# Date: Sun, 31 Jan 2016 19:04:23 GMT
#set_units -time ns
create_clock -name {Clock_RTOS(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {ADC_intClock(FFB)} -period 666.66666666666663 -waveform {0 333.333333333333} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {I2C_SCBCLK(FFB)} -period 166.66666666666666 -waveform {0 83.3333333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted2} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_1}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyEXTCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ext}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_RTOS} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 33 65} [list]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 17} [list]


# Component constraints for C:\Users\Vit\Documents\PSoC Creator\SensorTest\SensorTest.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Vit\Documents\PSoC Creator\SensorTest\SensorTest.cydsn\SensorTest.cyprj
# Date: Sun, 31 Jan 2016 19:04:21 GMT
